---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial
source: html/a02470b1-6055-c4f1-875d-d612ca28c4f2.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisMaterial

A description of a material with thermal properties in a composite construction.

## Syntax (C#)
```csharp
public class EnergyAnalysisMaterial : Element
```